trade_exp/src/Documents/ПриходныйКассовыйОрдер/ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриходныйКассовыйОрдер</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоверенностьВыданная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КурсКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВТомЧислеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПринятоОт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РаспоряжениеНаПеремещениеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДеньгиВнесеныCотрудником</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникВнесшийДеньги</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8883b2d0-a5b9-4340-ba78-26c65139acc4">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0a1c1d55-366e-43cb-8439-93ee576690ae">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58f144c7-5fda-443f-9eba-f223e9943695">
    <name>КратностьКурсаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cff8f06f-bc4b-4e6b-9b4d-5950964e2129">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДоговорКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорЗаймаСотруднику</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТипСуммыКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="10fa07b1-5a87-4461-aa12-363a0e2dcbe0">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aba486ff-7913-419f-a30a-54e7051d8781">
      <name>НастройкаСчетовУчета</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cb507992-a434-4b87-b5fc-2dedaaad5197">
      <name>ДоговорАренды</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="791145c7-c177-49dd-9f53-9f6842c3a1bd">
      <name>ТипПлатежаПоАренде</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ea2e5a37-549f-4567-b4af-235dd476e2cc">
      <name>РасчетныйДокументПоАренде</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b8195c88-ac4b-4fc2-a1c7-dceb6683e8f4">
      <name>КурсЗнаменательВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3dea0088-c6d9-458f-b093-d64eb55cdffd">
      <name>КурсЧислительВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c61a3692-b940-4015-bb16-55fe766bad68">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5572011c-09eb-401f-83fd-579e97ce4bda">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6ae13040-3ec8-4088-b96f-0f527dab3086">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1db7c744-182b-48e1-93fd-95d6c880eaf2">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЮрФизЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f77fc56-3329-4a10-b355-b5c40df8b5c5">
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1312f787-af91-4e9f-bb79-f968d50d327d">
    <name>ЮрЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ОбъектыРасчетов/ОбъектыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0c588f17-899d-4631-99f3-44aaf039357e">
  <name>ОбъектыРасчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="bba798d9-42bd-4341-8275-e5503a1fd11c">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d9b52c65-7828-4280-a247-e281ed971ffb">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Documents/ПриходныйКассовыйОрдер/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Перед("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполненияПеред(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АрендаНоменклатуры") Тогда
		
		ДокОснование = ДанныеЗаполнения;
		ДанныеЗаполнения = Новый Структура;

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокОснование, , "Номер,Дата");
		Основание = ДокОснование;
		ДокументОснование = ДокОснование;
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента;

		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокОснование, "Организация, Подразделение, Партнер, СуммаЗалога");
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ОбъектРасчетов = Договор;
		НоваяСтрока.Организация = Организация;
		НоваяСтрока.ВалютаВзаиморасчетов = Валюта;
		НоваяСтрока.Партнер = РеквизитыОснования.Партнер;
		НоваяСтрока.Сумма = РеквизитыОснования.СуммаЗалога;
		НоваяСтрока.СуммаВзаиморасчетов = НоваяСтрока.Сумма;
		НоваяСтрока.Подразделение = РеквизитыОснования.Подразделение;
		НоваяСтрока.СтавкаНДС = АльтерраОбщегоНазначения.ПолучитьСтавкуНДСФилиала(РеквизитыОснования.Организация);

		СтрокаGUID = "cd661a74-ae8f-11e9-80db-002590e168ab"; 	// Обеспечительный платёж за аренду номенклатуры
		НовыйGUID = Новый УникальныйИдентификатор(СтрокаGUID);
		НоваяСтрока.СтатьяДвиженияДенежныхСредств= Справочники.СтатьиДвиженияДенежныхСредств.ПолучитьСсылку(НовыйGUID);

		СтавкаНДСЧислом = УчетНДСУПКлиентСервер.ЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
		НоваяСтрока.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(НоваяСтрока.Сумма, СтавкаНДСЧислом, Истина);
		СуммаДокумента = РасшифровкаПлатежа.Итог("Сумма");

		ПринятоОт = "" + Контрагент + " (Обеспечительный платеж)";

		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполненияПосле(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Сотрудник = АльтерраОбщегоНазначения.ПолучитьСотрудника(Пользователи.ТекущийПользователь());
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Если ЗначениеЗаполнено(Сотрудник.Касса) Тогда
			Касса = Сотрудник.Касса;
			ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ТекущаяКасса", , Касса);
			ПодразделениеКассы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Касса, "Подразделение");
			Подразделение = ПодразделениеКассы;
//			ПодразделениеОтправитель = ПодразделениеКассы;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ХозяйственнаяОперация") Тогда
		
		Если ДанныеЗаполнения.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника Тогда
			ЗаполнитьТЧРасшифровка(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000004")); //ВОЗВРАТ ПОДОТЧЕТА	
		КонецЕсли;
		
		Если ДанныеЗаполнения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента Тогда
			Если ДанныеЗаполнения.Свойство("Контрагент") Тогда
				Если ДанныеЗаполнения.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
					ЗаполнитьТЧРасшифровка(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000007")); //ВЫРУЧКА ФИЗИЧЕСКИЕ ЛИЦА     
					ПринятоОт = "Физическое лицо";
				Иначе
					ЗаполнитьТЧРасшифровка(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000002")); //ПОСТУПЛЕНИЯ ОТ ПОКУПАТЕЛЕЙ
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТЧРасшифровка(Статья)
	Для Каждого стрРасшировка Из РасшифровкаПлатежа Цикл
		стрРасшировка.СтатьяДвиженияДенежныхСредств = Статья;
	КонецЦикла;
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	АльтерраОбщегоНазначения.ПроверитьКассыОрганизаций(ЭтотОбъект, Отказ);
		
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АрендаНоменклатуры") Тогда
		Если ДокументОснование.Статус <> Перечисления.СтатусыАренды.ВАренде Тогда
			Если Не РольДоступна("ПолныеПрава") Тогда
				Отказ= Истина;
			КонецЕсли;
			Сообщить("Оплатить можно только в статусе В аренде!", СтатусСообщения.ОченьВажное);
		КонецЕсли;
	КонецЕсли;

	Если ДеньгиВнесеныCотрудником = Истина И Не ЗначениеЗаполнено(СотрудникВнесшийДеньги) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите сотрудника, внесшего деньги";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры
&После("ЗаполнитьПоЗаказуКлиента")
Процедура Док_ЗаполнитьПоЗаказуКлиента(Знач ДокументОснование, ДанныеЗаполнения, СуммаКОплате)
	Если ДокументОснование.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		ПринятоОт = "Физическое лицо";
	КонецЕсли;
КонецПроцедуры

&После("ЗаполнитьПоРеализацииТоваров")
Процедура Док_ЗаполнитьПоРеализацииТоваров(Знач РеализацияТоваров, ДанныеЗаполнения, СуммаКОплате)
	
	Для Каждого ТекущаяСтрока Из РасшифровкаПлатежа Цикл
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ОбъектРасчетов) Тогда
			
			ТекущееОснование = ДанныеЗаполнения.ДокументОснование;
			ТекущаяСтрока.ОснованиеПлатежа = ТекущееОснование;
			ТекущаяСтрока.Партнер = ДанныеЗаполнения.Партнер;
			
			Если ЗначениеЗаполнено(ДанныеЗаполнения.Договор) Тогда
				ПараметрОбъект = ДанныеЗаполнения.Договор;
			Иначе
				ПараметрОбъект = ДанныеЗаполнения.ДокументОснование.ЗаказКлиента;
			КонецЕсли;
			
			ТекущаяСтрока.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ПараметрОбъект);

		КонецЕсли;

		Если Не ЗначениеЗаполнено(ТекущаяСтрока.СтавкаНДС) Тогда
			
			СтруктураПересчетаСуммы = Новый Структура;
			СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
			
			СтруктураПараметровДействия = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(
				ДанныеЗаполнения.ДокументОснование);
				
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", СтруктураПараметровДействия);
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			
			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
#КонецЕсли
